### Contents

01 Import libraries and dataset

02 Wrangling

03 Export dataframe

01 Import libraries and dataset

In [66]:
import pandas as pd
import numpy as np
import os

In [67]:
path = r"C:\Users\cathe\OneDrive\Data Analysis\2 4 Instacart Basket Analysis\02 Data"

In [68]:
df = pd.read_csv(os.path.join(path, 'Prepared Data', 'products_checked.csv'), index_col = False)

In [69]:
# Check dataframe

df.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

02 Wrangling

In [71]:
# Remove unwanted index column

df = df.drop(columns = ['Unnamed: 0'])

In [72]:
df.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [73]:
df.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [74]:
df_too_big = df[df['prices'] == 99999]

In [75]:
df_too_big

       product_id           product_name  aisle_id  department_id   prices
33649       33664  2 % Reduced Fat  Milk        84             16  99999.0

In [76]:
df_new = df[df['prices'] != 99999]

In [77]:
df_new.describe()

         product_id      aisle_id  department_id        prices
count  49671.000000  49671.000000   49671.000000  49671.000000
mean   24850.172334     67.762115      11.728856      7.980256
std    14340.795118     38.316100       5.850806     66.952504
min        1.000000      1.000000       1.000000      1.000000
25%    12432.500000     35.000000       7.000000      4.100000
50%    24850.000000     69.000000      13.000000      7.100000
75%    37268.500000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  14900.000000

In [78]:
df['prices'].value_counts(dropna = False)

prices
2.5        470
5.3        458
6.2        451
2.6        447
5.4        444
          ...
15.6         1
21.0         1
99999.0      1
14900.0      1
18.3         1
Name: count, Length: 242, dtype: int64

The prices above are not sorted, so this list might be hiding extra wrong figures

In [80]:
# Sorting by price

df_sorted = df_new.sort_values(by = 'prices')

In [81]:
df_sorted.tail()

,product_id,product_name,aisle_id,department_id,prices
9005,9020,Boneless Skinless Chicken Thighs,35,12,25.0
19376,19391,Turkey Breast Tenderloins,49,12,25.0
21452,21467,Wild Caught Raw Shrimp,15,12,25.0
40469,40486,Chicken Tenders,49,12,25.0
21538,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0

This confirms that 14900 is the last remaining obviously-wrong price.  I could remove this row, or assume that it is meant to read 14.9

In [83]:
# Update the price for product_id = 21553

df_new.loc[df_new['product_id'] == 21553, 'prices'] = 14.9

In [84]:
# Verify the change

print(df_new[df_new['product_id'] == 21553])

       product_id                      product_name  aisle_id  department_id  \
21538       21553  Lowfat 2% Milkfat Cottage Cheese       108             16

       prices
21538    14.9

In [85]:
df_new.describe()

         product_id      aisle_id  department_id        prices
count  49671.000000  49671.000000   49671.000000  49671.000000
mean   24850.172334     67.762115      11.728856      7.680582
std    14340.795118     38.316100       5.850806      4.199464
min        1.000000      1.000000       1.000000      1.000000
25%    12432.500000     35.000000       7.000000      4.100000
50%    24850.000000     69.000000      13.000000      7.100000
75%    37268.500000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000     25.000000

03 Export dataframe

In [109]:
df_new.to_csv(os.path.join(path, 'Prepared Data', 'products_checked_cleaned.csv'))